Add demo GIF to README
